app/views/pictures/index.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."picture_id" = $1  [["picture_id", 14]]
SELECT  1 AS one FROM "comments" WHERE "comments"."picture_id" = $1 LIMIT 1  [["picture_id", 13]]
SELECT "comments".* FROM "comments" WHERE "comments"."picture_id" = $1  [["picture_id", 13]]
---
    <%= link_to "Like", picture_likes_path(picture), class: 'likes-link' %>
    <span class="likes_count"> <%= picture.likes.count %> </span> <%= 'like'.pluralize(picture.likes.count) %>
    <% if picture.comments.any? %>