app/views/pictures/show.html.erb


<% if @picture.comments.any? %>
---
SELECT  1 AS one FROM "comments" WHERE "comments"."picture_id" = $1 LIMIT 1  [["picture_id", 13]]